import React from 'react';

class Layout1 extends React.Component {
  render() {
    return (
      <div
        style={{
          display: 'flex',
          flexDirection: 'column',
          alignItems: 'stretch',
          height: '100vh'
        }}
      >
        <div style={{ flexGrow: 0, flexShrink: 0, backgroundColor: 'yellow' }}>
          <h2>Header</h2>
        </div>
        <dlv
          style={{
            flexGrow: 1,
            flexShrink: 0,
            backgroundColor: 'green',
            display: 'flex',
            alignItems: 'stretch',
            height: '400px',
            overflowY: 'auto'
          }}
        >
          <div>
            <p>
              도널드 트럼프 미국 대통령이 29일 시진핑 중국 국가주석과의 무역회담
              이후 "화웨이 문제는 (무역협상) 막판까지 기다려야할 것"이라면서도
              "미국 기업들은 화웨이에 제품을 많이판다. 이들은 계속해서 화웨이에
              판매할 수 있을 것"이라고 말했다. 트럼프 대통령은 이틀간 일본
              오사카에서 열린 G20(주요 20개국) 정상회의 폐막 후 기자회견에서
              이같이 말했다. 트럼프 대통령은 이밖에 "미중 무역협상을 재개하고,
              적어도 협상이 유지되는한 새로운 관세는 없을 것"이라고도 말했다.
            </p>
            <p>
              도널드 트럼프 미국 대통령이 29일 시진핑 중국 국가주석과의 무역회담
              이후 "화웨이 문제는 (무역협상) 막판까지 기다려야할 것"이라면서도
              "미국 기업들은 화웨이에 제품을 많이판다. 이들은 계속해서 화웨이에
              판매할 수 있을 것"이라고 말했다. 트럼프 대통령은 이틀간 일본
              오사카에서 열린 G20(주요 20개국) 정상회의 폐막 후 기자회견에서
              이같이 말했다. 트럼프 대통령은 이밖에 "미중 무역협상을 재개하고,
              적어도 협상이 유지되는한 새로운 관세는 없을 것"이라고도 말했다.
            </p>
            <p>
              도널드 트럼프 미국 대통령이 29일 시진핑 중국 국가주석과의 무역회담
              이후 "화웨이 문제는 (무역협상) 막판까지 기다려야할 것"이라면서도
              "미국 기업들은 화웨이에 제품을 많이판다. 이들은 계속해서 화웨이에
              판매할 수 있을 것"이라고 말했다. 트럼프 대통령은 이틀간 일본
              오사카에서 열린 G20(주요 20개국) 정상회의 폐막 후 기자회견에서
              이같이 말했다. 트럼프 대통령은 이밖에 "미중 무역협상을 재개하고,
              적어도 협상이 유지되는한 새로운 관세는 없을 것"이라고도 말했다.
            </p>
            <p>
              도널드 트럼프 미국 대통령이 29일 시진핑 중국 국가주석과의 무역회담
              이후 "화웨이 문제는 (무역협상) 막판까지 기다려야할 것"이라면서도
              "미국 기업들은 화웨이에 제품을 많이판다. 이들은 계속해서 화웨이에
              판매할 수 있을 것"이라고 말했다. 트럼프 대통령은 이틀간 일본
              오사카에서 열린 G20(주요 20개국) 정상회의 폐막 후 기자회견에서
              이같이 말했다. 트럼프 대통령은 이밖에 "미중 무역협상을 재개하고,
              적어도 협상이 유지되는한 새로운 관세는 없을 것"이라고도 말했다.
            </p>
            <p>
              도널드 트럼프 미국 대통령이 29일 시진핑 중국 국가주석과의 무역회담
              이후 "화웨이 문제는 (무역협상) 막판까지 기다려야할 것"이라면서도
              "미국 기업들은 화웨이에 제품을 많이판다. 이들은 계속해서 화웨이에
              판매할 수 있을 것"이라고 말했다. 트럼프 대통령은 이틀간 일본
              오사카에서 열린 G20(주요 20개국) 정상회의 폐막 후 기자회견에서
              이같이 말했다. 트럼프 대통령은 이밖에 "미중 무역협상을 재개하고,
              적어도 협상이 유지되는한 새로운 관세는 없을 것"이라고도 말했다.
            </p>
            <p>
              도널드 트럼프 미국 대통령이 29일 시진핑 중국 국가주석과의 무역회담
              이후 "화웨이 문제는 (무역협상) 막판까지 기다려야할 것"이라면서도
              "미국 기업들은 화웨이에 제품을 많이판다. 이들은 계속해서 화웨이에
              판매할 수 있을 것"이라고 말했다. 트럼프 대통령은 이틀간 일본
              오사카에서 열린 G20(주요 20개국) 정상회의 폐막 후 기자회견에서
              이같이 말했다. 트럼프 대통령은 이밖에 "미중 무역협상을 재개하고,
              적어도 협상이 유지되는한 새로운 관세는 없을 것"이라고도 말했다.
            </p>
          </div>
        </dlv>
        <div style={{ flexGrow: 0, flexShrink: 0, backgroundColor: 'yellow' }}>
          <h2>Footer</h2>
        </div>
      </div>
    );
  }
}

export default Layout1;
